journal.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Journal</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="title" content="Journal"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-19 00:02:51 EDT"/>
<meta name="author" content="Neil Smithline"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">Journal</h1>




<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">2012</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1">2012-07 July</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1">2012-07-18 Wednesday</h4>
<div class="outline-text-4" id="text-1-1-1">


</div>

<div id="outline-container-1-1-1-1" class="outline-5">
<h5 id="sec-1-1-1-1">Initial Thoughts About Software Stack <span class="timestamp-wrapper"> <span class="timestamp">2012-07-18 Wed 20:29</span></span></h5>
<div class="outline-text-5" id="text-1-1-1-1">

<p>I have some initial thoughts about the software stack that will be where I initially experiment, evaluate, and design. The software stack in reverse order is:
</p><dl>
<dt>Org Mode &amp; Emacs</dt><dd>No explanation neceessary.
</dd>
<dt>Memacs</dt><dd>Will import the data into Emacs.
</dd>
<dt>GCal</dt><dd>Will be online store of data in the form of events within a specific calendar.
</dd>
<dt>Time Recording Pro</dt><dd>Android <a href="https://play.google.com/store/apps/details?id=com.dynamicg.timerecording.pro&amp;feature=search_result#?t=W251bGwsMSwxLDEsImNvbS5keW5hbWljZy50aW1lcmVjb3JkaW5nLnBybyJd">app</a> that will be input for activities. TRP has built-in integration with Gcal.
</dd>
<dt>Android Reminder/Notification App</dt><dd>An Android app that will notify me every N minutes (current thoughts are N=20) that I need to update my activities in TRP. I've only begun looking for reminder apps. <a href="https://play.google.com/store/apps/details?id=com.googlecode.mindbell&amp;feature=search_result#?t=W251bGwsMSwyLDEsImNvbS5nb29nbGVjb2RlLm1pbmRiZWxsIl0.">Mindfullness Bell</a> and <a href="https://play.google.com/store/apps/details?id=net.dinglisch.android.taskerm&amp;feature=search_result#?t=W251bGwsMSwyLDEsIm5ldC5kaW5nbGlzY2guYW5kcm9pZC50YXNrZXJtIl0.">Tasker</a> are two possibilities that I've looked at.
</dd>
<dt>Custom Utility to convert Org Mode Tags into TRP Data</dt><dd>TRP has native support for tasks and Org Mode supports tags. Having a 1-to-1 mapping between TRP tasks and Org Mode tags seems to provide many benefits. I do not believe (ie: I'm 99.99% certain) that there is an existing automated method to synchronize Org Mode tags and TRP tasks.
</dd>
</dl>

</div>

</div>

<div id="outline-container-1-1-1-2" class="outline-5">
<h5 id="sec-1-1-1-2">Time Capturing Device <span class="timestamp-wrapper"> <span class="timestamp">2012-07-18 Wed 20:26</span></span></h5>
<div class="outline-text-5" id="text-1-1-1-2">

<p>        At least for the first go, I will focus on time capturing exclusively via my Android smartphone as I have that with me constantly. No effort will be spent trying to utilize other devices for time capture.
</p></div>

</div>

<div id="outline-container-1-1-1-3" class="outline-5">
<h5 id="sec-1-1-1-3">Test 2 <span class="timestamp-wrapper"> <span class="timestamp">2012-07-18 Wed 20:21</span></span></h5>
<div class="outline-text-5" id="text-1-1-1-3">

<p>Testing to see if we have a reverse/prepend date tree work from capture template.
</p></div>

</div>

<div id="outline-container-1-1-1-4" class="outline-5">
<h5 id="sec-1-1-1-4">First journal entry <span class="timestamp-wrapper"> <span class="timestamp">2012-07-18 Wed 20:20</span></span></h5>
<div class="outline-text-5" id="text-1-1-1-4">

<p>Testing&hellip;.
</p></div>
</div>
</div>
</div>
</div>
</div>

</body>
</html>
